## staging: github
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                     NAME                     |
|----------|----------------------------------------------|
| recreate | `github_actions_secret.account_id`           |
|          | `github_actions_secret.api_account_id`       |
|          | `github_actions_secret.manifests_account_id` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_actions_secret.account_id must be replaced
-/+ resource "github_actions_secret" "account_id" {
      ~ created_at      = "2024-04-15 18:16:42 +0000 UTC" -> (known after apply)
      ~ id              = "notification-terraform:STAGING_ACCOUNT_ID" -> (known after apply)
      ~ secret_name     = "STAGING_ACCOUNT_ID" -> "STAGING_AWS_ACCOUNT_ID" # forces replacement
      ~ updated_at      = "2024-11-20 19:42:07 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.api_account_id must be replaced
-/+ resource "github_actions_secret" "api_account_id" {
      ~ created_at      = "2024-11-27 18:32:09 +0000 UTC" -> (known after apply)
      ~ id              = "notification-api:STAGING_ACCOUNT_ID" -> (known after apply)
      ~ secret_name     = "STAGING_ACCOUNT_ID" -> "STAGING_AWS_ACCOUNT_ID" # forces replacement
      ~ updated_at      = "2024-11-27 18:32:09 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.manifests_account_id must be replaced
-/+ resource "github_actions_secret" "manifests_account_id" {
      ~ created_at      = "2024-11-21 15:50:06 +0000 UTC" -> (known after apply)
      ~ id              = "notification-manifests:STAGING_ACCOUNT_ID" -> (known after apply)
      ~ secret_name     = "STAGING_ACCOUNT_ID" -> "STAGING_AWS_ACCOUNT_ID" # forces replacement
      ~ updated_at      = "2024-11-21 15:50:06 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
